tap "charmbracelet/tap"
tap "wezterm/wezterm-linuxbrew" if OS.linux? && Hardware::CPU.intel?

# core
brew "curl"
brew "coreutils" if OS.mac?
brew "direnv"
brew "file"
brew "fish" if OS.mac?
brew "fzf"
brew "gcc" if OS.mac?
brew "git"
brew "gnu-tar" if OS.mac?
brew "jq"
brew "neovim"
brew "parallel" if OS.mac?
brew "unar"

# lang
brew "go"
brew "rustup", postinstall: "#{HOMEBREW_PREFIX}/bin/rustup-init -y --default-toolchain stable --no-modify-path"
brew "uv", postinstall: "#{HOMEBREW_PREFIX}/bin/uv python install"
brew "ruff"
brew "ty"

# media
brew "exiftool"
brew "imagemagick-full"
brew "mkvtoolnix"
brew "yt-dlp"
cask "handbrake-app"
flatpak "fr.handbrake.ghb"
cask "iina"
cask "vlc"
flatpak "org.videolan.VLC"

# extras
brew "awscli"
brew "bat"
uv "beancount" unless ENV["CI"]
brew "btop"
brew "charmbracelet/tap/crush"
brew "doggo"
brew "dust"
brew "eza"
brew "fd"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "glow"
brew "grex"
brew "gum"
uv "harlequin"
brew "httpie"
brew "lazydocker"
brew "lazygit"
brew "libpq", link: true
brew "mas" if OS.mac?
uv "posting"
uv "pre-commit"
uv "pynvim"
go "github.com/vitor-mariano/regex-tui"
brew "ripgrep"
brew "starship"
brew "tree-sitter-cli"
brew "typst"
brew "vhs"
brew "xan"
brew "zoxide"

# apps

cask "1password"
cask "arc"
cask "ausweisapp"
flatpak "de.bund.ausweisapp.ausweissapp"
cask "claude"
cask "claude-code@latest"
cask "docker-desktop"  # `curl ... | sh` on linux
cask "firefox"
cask "ghostty"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "sozercan/repo/kaset" if MacOS.version >= :tahoe
cask "librewolf"
flatpak "io.gitlab.librewolf-community"
cask "linearmouse"
cask "macfuse"
cask "monitorcontrol"
cask "nextcloud"
flatpak "com.nextcloud.desktopclient.nextcloud"
cask "notion-calendar"
cask "obsidian"
flatpak "md.obsidian.Obsidian"
cask "ollama-app"
cask "raycast"
cask "signal"
flatpak "org.signal.Signal"
cask "slack"
flatpak "com.slack.Slack"
cask "steam"
flatpak "com.valvesoftware.Steam"
cask "tailscale-app"  # `curl ... | sh` on linux
cask "the-unarchiver"
cask "utm"
cask "wezterm" if OS.mac?
brew "wezterm" if OS.linux? && Hardware::CPU.intel?
cask "zed"  # `curl ... | sh` on linux

unless ENV["CI"]  # mas needs app-store sign in and would hang
  mas "Things", id: 904280696
  mas "Infuse", id: 1136220934
end

cask "font-maple-mono-nf"
cask "font-monaspace-nf"
cask "font-pt-mono"
cask "font-sauce-code-pro-nerd-font"
