# CLI tools (cross-platform)
brew "bat"
brew "coreutils"
brew "curl"
brew "direnv"
brew "doggo"
brew "dust"
brew "eza"
brew "fd"
brew "file"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lz4"
brew "neovim"
brew "p7zip"
brew "parallel"
brew "podman"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "unzip"
brew "wget"
brew "yt-dlp"
brew "zoxide"

if OS.mac?
  brew "1password-cli"
  brew "awscli"
  brew "dockutil"
  brew "libpq"

  cask "1password"
  cask "arc"
  cask "firefox@developer-edition"
  cask "jetbrains-toolbox"
  cask "karabiner-elements"
  cask "linearmouse"
  cask "monitorcontrol"
  cask "notion-calendar"
  cask "podman-desktop"
  cask "raycast"
  cask "slack"
  cask "the-unarchiver"
  cask "unar"
  cask "utm"
  cask "wezterm"
end

if OS.linux?
  flatpak "io.podman_desktop.PodmanDesktop"
end

# uv tools
uv "beancount"
